# JOINS WITH PANDAS (MERGES)

@autor Israel Sanchez

In [1]:
# importing the module
import pandas as pd

# Sample 1

In [2]:
# creating the first DataFrame
df1 = pd.DataFrame({"fruit" : ["apple", "banana", "avocado"],
                    "market_price" : [21, 14, 35]})
display("The first DataFrame")
display(df1)

'The first DataFrame'

     fruit  market_price
0    apple            21
1   banana            14
2  avocado            35

## inner uses Fruit to join both dataframes

In [4]:
# creating the second DataFrame
df2 = pd.DataFrame({"fruit" : ["banana", "apple", "avocado"],
                    "wholesaler_price" : [65, 68, 75]})
display("The second DataFrame")
display(df2)
display(df1)
  
# joining the DataFrames
display("The merged DataFrame")
pd.merge(df1, df2, on = "fruit", how = "inner")

'The second DataFrame'

     fruit  wholesaler_price
0   banana                65
1    apple                68
2  avocado                75

     fruit  market_price
0    apple            21
1   banana            14
2  avocado            35

'The merged DataFrame'

     fruit  market_price  wholesaler_price
0    apple            21                68
1   banana            14                65
2  avocado            35                75

# Sample 2

In [23]:
  
# creating the first DataFrame
df1 = pd.DataFrame({"fruit" : ["apple", "banana", 
                               "avocado", "grape"],
                    "market_price" : [21, 14, 35, 38]})

## join *outer* ignore records that dont match on the join

In [17]:
display("The first DataFrame")
display(df1)  
# creating the second DataFrame
df2 = pd.DataFrame({"fruit" : ["apple", "banana", "grape"],
                    "wholesaler_price" : [65, 68, 71]})
display("The second DataFrame")
display(df2)

'The first DataFrame'

     fruit  market_price
0    apple            21
1   banana            14
2  avocado            35
3    grape            38

'The second DataFrame'

    fruit  wholesaler_price
0   apple                65
1  banana                68
2   grape                71

## outer

In [19]:
# joining the DataFrames
# here both common DataFrame elements are in df1 and df2, 
# so it extracts apple, banana, grapes from df1 and df2.  
display("The merged DataFrame -- Avocado is nan no records included on the dataset second dataset")
pd.merge(df1, df2, on = "fruit", how = "outer")

'The merged DataFrame -- Avocado is nan no records included on the dataset second dataset'

     fruit  market_price  wholesaler_price
0    apple            21              65.0
1   banana            14              68.0
2  avocado            35               NaN
3    grape            38              71.0

## Left

In [20]:
pd.merge(df1, df2, on = "fruit", how = "left")

     fruit  market_price  wholesaler_price
0    apple            21              65.0
1   banana            14              68.0
2  avocado            35               NaN
3    grape            38              71.0

## Rigth

In [22]:
pd.merge(df1, df2, on = "fruit", how = "right")
# on this cae only the records in the DF2 are displayed because only Apple, Banana & grape are present and match with DF1

    fruit  market_price  wholesaler_price
0   apple            21                65
1  banana            14                68
2   grape            38                71

# Sample 3. Join as multiple columns, with same column names Fruit & size

In [29]:
df1 = pd.DataFrame({"fruit" : ["apple", "banana", "avocado","apple"],
                    "size" : ["small", "medium", "medium","medium"],
                    "market_price" : [21, 14, 35,30]})

df2 = pd.DataFrame({"fruit" : ["apple",  "avocado","apple"],
                    "size" : ["small",  "medium","medium"],
                    "retail_price" : [16, 30,25]})
display("Dataframe 1 with market price")
display(df1)
display("Dataframe 1 with reail price")
display(df2)

'Dataframe 1 with market price'

     fruit    size  market_price
0    apple   small            21
1   banana  medium            14
2  avocado  medium            35
3    apple  medium            30

'Dataframe 1 with reail price'

     fruit    size  retail_price
0    apple   small            16
1  avocado  medium            30
2    apple  medium            25

## Left Join

In [30]:
pd.merge(df1, df2,  how='left', left_on=['fruit','size'], right_on = ['fruit','size'])

     fruit    size  market_price  retail_price
0    apple   small            21          16.0
1   banana  medium            14           NaN
2  avocado  medium            35          30.0
3    apple  medium            30          25.0

## Sum sample 3.1   multiple columns different column names "Fruta & Tamanio" vs "Fruit & size"

In [33]:
df1 = pd.DataFrame({"fruta" : ["apple", "banana", "avocado","apple"],
                    "tamanio" : ["small", "medium", "medium","medium"],
                    "market_price" : [21, 14, 35,30]})

df2 = pd.DataFrame({"fruit" : ["apple",  "avocado","apple"],
                    "size" : ["small",  "medium","medium"],
                    "retail_price" : [16, 30,25]})
display("Dataframe 1 with market price")
display(df1)
display("Dataframe 1 with reail price")
display(df2)

'Dataframe 1 with market price'

     fruta tamanio  market_price
0    apple   small            21
1   banana  medium            14
2  avocado  medium            35
3    apple  medium            30

'Dataframe 1 with reail price'

     fruit    size  retail_price
0    apple   small            16
1  avocado  medium            30
2    apple  medium            25

###  *on this case banana record not exist in the rt side df2 vs df1*

In [34]:
pd.merge(df1, df2,  how='left', left_on=['fruta','tamanio'], right_on = ['fruit','size'])

     fruta tamanio  market_price    fruit    size  retail_price
0    apple   small            21    apple   small          16.0
1   banana  medium            14      NaN     NaN           NaN
2  avocado  medium            35  avocado  medium          30.0
3    apple  medium            30    apple  medium          25.0

###  *on this case banana record not exist in the left side df2 vs df1 the right condition excludes the record of banana

In [36]:
pd.merge(df1, df2,  how='right', left_on=['fruta','tamanio'], right_on = ['fruit','size'])

     fruta tamanio  market_price    fruit    size  retail_price
0    apple   small            21    apple   small            16
1  avocado  medium            35  avocado  medium            30
2    apple  medium            30    apple  medium            25